In [7]:
import pandas as pd

In [8]:
employees = pd.read_csv("pandas_8.csv")

In [14]:
employees["salary"] = employees["salary"] * 2

In [2]:
def modifySalaryColumn(employees: pd.DataFrame) -> pd.DataFrame:
    return employees[employees["salary"] * 2]

In [15]:
employees

      name  salary
0     Jack   39332
1    Piper  149508
2      Mia  125018
3  Ulysses  109732